Revit 2025 API
View.Duplicate Method
 Duplicates this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public ElementId Duplicate(
	ViewDuplicateOption duplicateOption
)
Public Function Duplicate (
	duplicateOption As ViewDuplicateOption
) As ElementId
public:
ElementId^ Duplicate(
	ViewDuplicateOption duplicateOption
)
member Duplicate :
        duplicateOption : ViewDuplicateOption -> ElementId
Parameters
duplicateOption ViewDuplicateOption
 The option to use when duplicating the view.
Return Value
ElementId
 The id of the newly created view.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  View cannot be duplicated
Example
public View CreateDependentCopy(View view)
{
    View dependentView = null;
    ElementId newViewId = ElementId.InvalidElementId;
    if (view.CanViewBeDuplicated(ViewDuplicateOption.AsDependent))
    {
        newViewId = view.Duplicate(ViewDuplicateOption.AsDependent);
        dependentView = view.Document.GetElement(newViewId) as View;
        if (null != dependentView)
        {
            if (dependentView.GetPrimaryViewId() == view.Id)
            {
                TaskDialog.Show("Dependent View", "Dependent view created successfully!");
            }
        }
    }
    return dependentView;
}
Public Function CreateDependentCopy(view As View) As View
    Dim dependentView As View = Nothing
    Dim newViewId As ElementId = ElementId.InvalidElementId
    If view.CanViewBeDuplicated(ViewDuplicateOption.AsDependent) Then
        newViewId = view.Duplicate(ViewDuplicateOption.AsDependent)
        dependentView = TryCast(view.Document.GetElement(newViewId), View)
        If dependentView IsNot Nothing Then
            If dependentView.GetPrimaryViewId() = view.Id Then
                TaskDialog.Show("Dependent View", "Dependent view created successfully!")
            End If
        End If
    End If
    Return dependentView
End Function
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace